const outType = [{
    "id": 1,
    "name": "餐饮",
    "sub": [{
        "id": 2,
        "name": "早餐"
    }, {
        "id": 3,
        "name": "午餐"
    }, {
        "id": 4,
        "name": "晚餐"
    }, {
        "id": 5,
        "name": "宵夜"
    }, {
        "id": 6,
        "name": "零食"
    }, {
        "id": 7,
        "name": "饮料"
    }, {
        "id": 8,
        "name": "酒类"
    }, {
        "id": 9,
        "name": "水果"
    }]
}, {
    "id": 10,
    "name": "交通",
    "sub": [{
        "id": 11,
        "name": "公交"
    }, {
        "id": 12,
        "name": "地铁"
    }, {
        "id": 13,
        "name": "客车"
    }, {
        "id": 14,
        "name": "打的"
    }, {
        "id": 15,
        "name": "飞机"
    }, {
        "id": 16,
        "name": "火车"
    }, {
        "id": 17,
        "name": "轮船"
    }]
}, {
    "id": 18,
    "name": "游戏",
    "sub": [{
        "id": 19,
        "name": "充值"
    }, {
        "id": 20,
        "name": "购买"
    }]
}, {
    "id": 21,
    "name": "购物",
    "sub": [{
        "id": 22,
        "name": "服装"
    }, {
        "id": 23,
        "name": "饰品"
    }, {
        "id": 24,
        "name": "鞋类"
    }, {
        "id": 25,
        "name": "3C电子"
    }, {
        "id": 26,
        "name": "家用电器"
    }]
}, {
    "id": 27,
    "name": "日常用品",
    "sub": [{
        "id": 28,
        "name": "牙刷牙膏"
    }, {
        "id": 29,
        "name": "毛巾"
    }, {
        "id": 30,
        "name": "香皂/沐浴露"
    }, {
        "id": 31,
        "name": "洗发液"
    }, {
        "id": 32,
        "name": "床上用品"
    }, {
        "id": 33,
        "name": "水杯酒具"
    }]
}, {
    "id": 34,
    "name": "五金",
    "sub": [{
        "id": 35,
        "name": "家用工具"
    }, {
        "id": 36,
        "name": "灯饰"
    }]
}, {
    "id": 37,
    "name": "住房网络",
    "sub": [{
        "id": 38,
        "name": "房租"
    }, {
        "id": 39,
        "name": "水电气物业"
    }]
}, {
    "id": 40,
    "name": "定期支出",
    "sub": [{
        "id": 41,
        "name": "网费"
    }, {
        "id": 42,
        "name": "电话费"
    }, {
        "id": 43,
        "name": "会员充值"
    }]
}, {
    "id": 44,
    "name": "娱乐休闲",
    "sub": [{
        "id": 45,
        "name": "约会"
    }, {
        "id": 46,
        "name": "游玩"
    }, {
        "id": 47,
        "name": "运动健身"
    }, {
        "id": 48,
        "name": "聚餐"
    }]
}, {
    "id": 49,
    "name": "人情往来",
    "sub": [{
        "id": 50,
        "name": "请客送礼"
    }, {
        "id": 51,
        "name": "孝敬家长"
    }, {
        "id": 52,
        "name": "红白喜事"
    }]
}, {
    "id": 53,
    "name": "医疗保险",
    "sub": [{
        "id": 54,
        "name": "药品费"
    }, {
        "id": 55,
        "name": "诊疗费"
    }]
}, {
    "id": 56,
    "name": "金融保险",
    "sub": [{
        "id": 57,
        "name": "基金"
    }, {
        "id": 58,
        "name": "股票"
    }, {
        "id": 59,
        "name": "定期"
    }]
}, {
    "id": 60,
    "name": "学习",
    "sub": [{
        "id": 61,
        "name": "学习资料"
    }, {
        "id": 62,
        "name": "培训"
    }]
}, {
    "id": 63,
    "name": "其他",
    "sub": [{
        "id": 64,
        "name": "丢失钱物"
    }, {
        "id": 65,
        "name": "其他"
    }]
}];
const inType = [{
    "id": 66,
    "name": "工资薪水",
    "sub": [{
        "id": 67,
        "name": "工资"
    }, {
        "id": 68,
        "name": "兼职"
    }]
}, {
    "id": 69,
    "name": "金融投资",
    "sub": [{
        "id": 70,
        "name": "基金"
    }, {
        "id": 71,
        "name": "股票"
    }, {
        "id": 72,
        "name": "定期"
    }]
}, {
    "id": 73,
    "name": "其他",
    "sub": [{
        "id": 74,
        "name": "礼金"
    }, {
        "id": 75,
        "name": "其他"
    }]
}];
export {
    outType,
    inType
}